ThisIsNotRocketScience/Syntonovo_PAN/controller/pan_sh/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins(void)
{
    /* Enables the clock for the input muxes. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t SLATCH1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 67)  */
    GPIO_PinInit(BOARD_INITPINS_SLATCH1_GPIO, BOARD_INITPINS_SLATCH1_PORT, BOARD_INITPINS_SLATCH1_PIN, &SLATCH1_config);

    gpio_pin_config_t EIN_EXT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_EIN_EXT_GPIO, BOARD_INITPINS_EIN_EXT_PORT, BOARD_INITPINS_EIN_EXT_PIN, &EIN_EXT_config);

    gpio_pin_config_t FC3_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 82)  */
    GPIO_PinInit(BOARD_INITPINS_FC3_INT_GPIO, BOARD_INITPINS_FC3_INT_PORT, BOARD_INITPINS_FC3_INT_PIN, &FC3_INT_config);

    gpio_pin_config_t TUNE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_TUNE_GPIO, BOARD_INITPINS_TUNE_PORT, BOARD_INITPINS_TUNE_PIN, &TUNE_config);

    gpio_pin_config_t GATE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_GATE_GPIO, BOARD_INITPINS_GATE_PORT, BOARD_INITPINS_GATE_PIN, &GATE_config);

    gpio_pin_config_t SELF_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_SELF_GPIO, BOARD_INITPINS_SELF_PORT, BOARD_INITPINS_SELF_PIN, &SELF_config);

    gpio_pin_config_t SELE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 4)  */
    GPIO_PinInit(BOARD_INITPINS_SELE_GPIO, BOARD_INITPINS_SELE_PORT, BOARD_INITPINS_SELE_PIN, &SELE_config);

    gpio_pin_config_t TESTMODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_TESTMODE_GPIO, BOARD_INITPINS_TESTMODE_PORT, BOARD_INITPINS_TESTMODE_PIN, &TESTMODE_config);

    gpio_pin_config_t SLATCH0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_SLATCH0_GPIO, BOARD_INITPINS_SLATCH0_PORT, BOARD_INITPINS_SLATCH0_PIN, &SLATCH0_config);

    gpio_pin_config_t SELINHG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 94)  */
    GPIO_PinInit(BOARD_INITPINS_SELINHG_GPIO, BOARD_INITPINS_SELINHG_PORT, BOARD_INITPINS_SELINHG_PIN, &SELINHG_config);

    gpio_pin_config_t LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin 88)  */
    GPIO_PinInit(BOARD_INITPINS_LED_GPIO, BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, &LED_config);

    gpio_pin_config_t SELB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 47)  */
    GPIO_PinInit(BOARD_INITPINS_SELB_GPIO, BOARD_INITPINS_SELB_PORT, BOARD_INITPINS_SELB_PIN, &SELB_config);

    gpio_pin_config_t SELC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin 5)  */
    GPIO_PinInit(BOARD_INITPINS_SELC_GPIO, BOARD_INITPINS_SELC_PORT, BOARD_INITPINS_SELC_PIN, &SELC_config);

    gpio_pin_config_t SELA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_SELA_GPIO, BOARD_INITPINS_SELA_PORT, BOARD_INITPINS_SELA_PIN, &SELA_config);

    gpio_pin_config_t FC2_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_FC2_INT_GPIO, BOARD_INITPINS_FC2_INT_PORT, BOARD_INITPINS_FC2_INT_PIN, &FC2_INT_config);

    gpio_pin_config_t SRESET2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_24 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_SRESET2_GPIO, BOARD_INITPINS_SRESET2_PORT, BOARD_INITPINS_SRESET2_PIN, &SRESET2_config);

    gpio_pin_config_t SLATCH2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_SLATCH2_GPIO, BOARD_INITPINS_SLATCH2_PORT, BOARD_INITPINS_SLATCH2_PIN, &SLATCH2_config);

    gpio_pin_config_t SELD_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_31 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_SELD_GPIO, BOARD_INITPINS_SELD_PORT, BOARD_INITPINS_SELD_PIN, &SELD_config);
    /* PIO0_31 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort0Pin31ToPintsel);

